fireFoam-1.6-1.0/tutorials/CounterFlowFlame2D/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-0.1 -0.1 -0.01)
    (0.1 -0.1 -0.01)
    (0.1 0.1 -0.01)
    (-0.1 0.1 -0.01)
    (-0.1 -0.1 0.01)
    (0.1 -0.1 0.01)
    (0.1 0.1 0.01)
    (-0.1 0.1 0.01)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)

);

edges           
(
);

patches         
(
    patch inlet1 
    (
        (0 4 7 3)
    )
    patch inlet2 
    (
        (1 2 6 5)
    )
    patch outlet1 
    (
        (0 1 5 4)
    )
    patch outlet2
    (
        (7 6 2 3)
    )
    empty frontAndBack
    (
        (4 5 6 7)
        (0 3 2 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
