fireFoam-1.6-1.0/tutorials/CounterFlowFlame2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/bauwensc/FireStuff";
    case            "Plume";
    instance        "system";
    local           "";

    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//  default         backward;
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;


    div(Ji,Ii_h)    Gauss linearUpwind Gauss linear; //Gauss upwind;

    div(phi,U)      Gauss filteredLinear 0.2 0.05;
//    div(phi,U)      Gauss limitedLinear 1.0;
    div(phi,k)      Gauss limitedLinear 1.0;
    div(phi,h)      Gauss limitedLinear 1.0;
    div(phi,hc)      Gauss limitedLinear 1.0;
    div(phi,hs)      Gauss limitedLinear 1.0;
    div(phi,ft)     Gauss limitedLinear01 1;
    div(phi,fu)     Gauss limitedLinear 1;
    div(phi,ftVar)     Gauss limitedLinear 1;
    flux(phi,ft)     Gauss limitedLinear01 1;
    div(phi,ft_b_h) Gauss multivariateSelection 
    {
        ft              limitedLinear01 1;
        h               limitedLinear 1;
    };
    div((muEff*dev2(grad(U).T()))) Gauss linear;
}

laplacianSchemes
{
//    default         none;
    default         Gauss linear corrected;
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(DBEff,B) Gauss linear corrected;
    laplacian((rho*(1|A(U))),pd) Gauss linear corrected;
    laplacian(muEff,b) Gauss linear corrected;
    laplacian(muEff,ft) Gauss linear corrected;
    laplacian(alphaEff,h) Gauss linear corrected;
    laplacian(alphaEff,hu) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    pd;
}


// ************************************************************************* //
